;(function($) {
	
	var categorys = [
	             	'购物',
	             	'追星族',
	             	'影视音乐',
	             	'游戏',
	             	'置业安居',
	             	'车行天下',
	             	'星座缘分',
	             	'动漫',
	             	'考试培训',
	             	'体育',
	             	'职业交流',
	             	'技术联盟',
	             	'同事录',
	             	'老乡会',
	             	'旅游',
	             	'同城对碰',
	             	'读书会',
	             	'生活休闲',
	             	'商业金融',
	             	'原创空间',
	             	'同学'
	             ];
    var catalogs = {
	             	'购物' : ['电脑','通讯设备','摄像摄影','音响','运动休闲','动漫游戏','古董收藏','汽车','游戏装备交易区','珠宝饰品','化妆品','女装','女士配件','男士精品','家居日用','家用电子电器','玩具','工艺精品','其他',],
	             	'追星族' : ['港台明星','内地明星','日韩明星','欧美明星','体坛明星','其他',],
	             	'影视音乐' : ['电影发烧','电视剧迷','淘碟一族','影音共享','古典音乐','HipHop','乐坛流行','摇滚','音乐原创','DV原创','其他',],
	             	'游戏' : ['QQ游戏','单机游戏','PS2/XBOX','经典怀旧','其他游戏','网络游戏','电脑游戏','电视游戏','手机游戏','腾讯游戏',],
	             	'置业安居' : ['北京市','天津市','上海市','重庆市','河北省','山西省','辽宁省','吉林省','江苏省','浙江省','安徽省','福建省','江西省','山东省','河南省','内蒙古自治区','黑龙江省','湖北省','湖南省','广东省','广西壮族自治区','海南省','四川省','台湾省','贵州省','云南省','陕西省','西藏自治区','甘肃省','青海省','宁夏回族自治区','新疆维吾尔自治区','香港特别行政区','澳门特别行政区', '生物工程',],
	             	'车行天下' : ['奥迪','桑塔纳','捷达','帕萨特','奥拓','富康','别克','宝来','英格尔','切诺基','路宝','奇瑞','夏利','赛欧','中华','福莱尔','红旗','波罗','海马','本田','吉利','美日','东风日产','派力奥','悦达','威驰','中兴','长城赛弗','猎豹俱乐部','风行MPV俱乐部','高尔','菱帅','赛纳','马自达6','大众高尔夫','奇瑞QQ','凯越','帕拉丁','飞度','花冠','标致307','蒙迪欧','嘉年华','威姿','威乐','伊兰特','毕加索','欧蓝德','赛马','本田CR-V','幸福使者','宝马',],
	             	'星座缘分' : ['同年月日','血型','魔法占卜','牧羊座','金牛座','双子座','巨蟹座','狮子座','处女座','天枰座','天蝎座','射手座','魔羯座','水瓶座','双鱼座','其他',],
	             	'动漫' : ['动漫家族','动漫周边','动漫音乐','cosplay','动漫原创','动漫文学',],
	             	'考试培训' : ['大学英语四/六级','高考','考研','公务员','MBA','新东方','注册会计师','国家司法考试','留学','IT认证','其他考试',],
	             	'体育' : ['篮球','足球','排球','网球','乒乓球','羽毛球','健身爱好','户外运动','水上运动','棋类','极限运动','其他',],
	             	'职业交流': ['求职','IT族','打工一族','自由职业','市场营销','广告人','公务员','服务行业','教师','律师','其他行业','媒体工作者',],
	             	'技术联盟' : ['电脑DIY','硬件研究','软件交流','网络技术','玩转手机','数码产品','黑客技术','网页制作','其他',	],
	             	'同事录' : ['北京市','天津市','上海市','重庆市','河北省','山西省','辽宁省','吉林省','江苏省','浙江省','安徽省','福建省','江西省','山东省','河南省','内蒙古自治区','黑龙江省','湖北省','湖南省','广东省','广西壮族自治区','海南省','四川省','台湾省','贵州省','云南省','陕西省','西藏自治区','甘肃省','青海省','宁夏回族自治区','新疆维吾尔自治区','香港特别行政区','澳门特别行政区',],
	             	'老乡会' : ['北京市','天津市','上海市','重庆市','河北省','山西省','辽宁省','吉林省','江苏省','浙江省','安徽省','福建省','江西省','山东省','河南省','内蒙古自治区','黑龙江省','湖北省','湖南省','广东省','广西壮族自治区','海南省','四川省','台湾省','贵州省','云南省','陕西省','西藏自治区','甘肃省','青海省','宁夏回族自治区','新疆维吾尔自治区','香港特别行政区','澳门特别行政区',],
	                '旅游' : ['自助游','自驾游','探险猎奇','驴友','景点','其他',],
	                '同城对碰' : ['北京市','天津市','上海市','重庆市','河北省','山西省','辽宁省','吉林省','江苏省','浙江省','安徽省','福建省','江西省','山东省','河南省','内蒙古自治区','黑龙江省','湖北省','湖南省','广东省','广西壮族自治区','海南省','四川省','台湾省','贵州省','云南省','陕西省','西藏自治区','甘肃省','青海省','宁夏回族自治区','新疆维吾尔自治区','香港特别行政区','澳门特别行政区',],
	                '读书会' : ['武侠迷','言情迷','现代文学','钟爱网文','侦探迷','科幻奇幻','不忘经典',],
	                '生活休闲' : ['天下美食','shopping','护肤美容','摄影玩家','家有宠物','夜生活','小资情趣','健康生活','个人爱好','表演天地','情感区','家居潮流','婴幼宝贝',],
	                '商业金融' : ['公司','工作和就业','金融专才','自由职业者','行业协会','商学院','投资','营销和广告','新闻媒体','公共关系','房地产','小生意',],
	                '原创空间' : ['音乐原创','DV原创','动漫原创','闪客原创','文学原创','其他',],
	                '同学' : ['北京市','天津市','上海市','重庆市','河北省','山西省','辽宁省','吉林省','江苏省','浙江省','安徽省','福建省','江西省','山东省','河南省','内蒙古自治区','黑龙江省','湖北省','湖南省','广东省','广西壮族自治区','海南省','四川省','台湾省','贵州省','云南省','陕西省','西藏自治区','甘肃省','青海省','宁夏回族自治区','新疆维吾尔自治区','香港特别行政区','澳门特别行政区',]
	             };
	
	$.fn.cateSelect = function() {
		var self = this;
		$('#categorypop').dialog('destroy');
		$("#categorypop").remove();
		self.after('<div id="categorypop" title="选择您的群组类别">'
				+ '<dl id="categorypopbody" class="b_sch">'
				+ '<dt></dt>'
				+ '<dd></dd>'
				+ '</dl>'
				+ '</div>'
				);
		//$.ui.dialog.defaults.bgiframe = true;
		$('#categorypop').dialog({ autoOpen: false, width: 633, height : 403, draggable : true, resizable : false });
		$(document).data('categorypopid', self.attr('id'));

		// init category
		var catecontent = '<p class="b_sch_t">大分类</p><ul class="clearfix">';
		for (var i in categorys) {
			catecontent += '<li><a href="#">';
			catecontent += categorys[i];
			catecontent += '</a></li>';	
		}
		catecontent += '</ul>';
		$('.b_sch dt').append(catecontent);
		// register handler for cates option
		
		$('.b_sch dt a').click(function(){
			$(document).data('categorypopcate', $(this).text());
			
			// load citys
			var catacontent = '<dd><p>小分类</p><ul class="clearfix">';
			for (var j in catalogs[$(this).text()]) { 
				catacontent += '<li><a href="#" class="b_schdda">';
				catacontent += catalogs[$(this).text()][j];
				catacontent += '</a></li>';	
			}
			catacontent += '</ul></dd>';
			$('.b_sch dd').replaceWith(catacontent);
			$('.b_sch a.b_schdda').click(function(){
				$(document).data('catapopcata', $(this).text());
				$('#category').val($(document).data('categorypopcate'));
				$('#catalog').val($(document).data('catapopcata'));
				$('#' + $(document).data('categorypopid')).attr('value', 
							$(document).data('categorypopcate') + ' - ' + $(document).data('catapopcata'));

				var inp = $('#' + $(document).data('categorypopid')).get(0);
				$.data(inp.form, 'validator').element(inp);
				$('#categorypop').dialog('close');
				return false;
			});
			return false;
		});
		
		self.unbind('focus').focus(function(){
			$('#categorypop').dialog('open');
		}).unbind('click').click(function(){
			$('#categorypop').dialog('open');
		});
	};
})(jQuery);